smartinou/pfpp/firmware/apps/test_rtcc/startup_TM4C129ENCPDT.cpp
    // IRQ handlers...
    (int)&GPIOPortA_IRQHandler,   /* GPIO Port A                     */
    (int)&GPIOPortB_IRQHandler,   /* GPIO Port B                     */
    (int)&GPIOPortC_IRQHandler,   /* GPIO Port C                     */
    (int)&GPIOPortD_IRQHandler,   /* GPIO Port D                     */
    (int)&GPIOPortE_IRQHandler,   /* GPIO Port E                     */
    (int)&UART0_IRQHandler,       /* UART0 Rx and Tx                 */
    (int)&UART1_IRQHandler,       /* UART1 Rx and Tx                 */
    (int)&SSI0_IRQHandler,        /* SSI0 Rx and Tx                  */
    (int)&I2C0_IRQHandler,        /* I2C0 Master and Slave           */
    (int)&PWMFault_IRQHandler,    /* PWM Fault                       */
    (int)&PWMGen0_IRQHandler,     /* PWM Generator 0                 */
    (int)&PWMGen1_IRQHandler,     /* PWM Generator 1                 */
    (int)&PWMGen2_IRQHandler,     /* PWM Generator 2                 */
    (int)&QEI0_IRQHandler,        /* Quadrature Encoder 0            */
    (int)&ADCSeq0_IRQHandler,     /* ADC Sequence 0                  */
    (int)&ADCSeq1_IRQHandler,     /* ADC Sequence 1                  */
    (int)&ADCSeq2_IRQHandler,     /* ADC Sequence 2                  */
    (int)&ADCSeq3_IRQHandler,     /* ADC Sequence 3                  */
    (int)&Watchdog_IRQHandler,    /* Watchdog timer                  */
    (int)&Timer0A_IRQHandler,     /* Timer 0 subtimer A              */
    (int)&Timer0B_IRQHandler,     /* Timer 0 subtimer B              */
    (int)&Timer1A_IRQHandler,     /* Timer 1 subtimer A              */
    (int)&Timer1B_IRQHandler,     /* Timer 1 subtimer B              */
    (int)&Timer2A_IRQHandler,     /* Timer 2 subtimer A              */
    (int)&Timer2B_IRQHandler,     /* Timer 2 subtimer B              */
    (int)&Comp0_IRQHandler,       /* Analog Comparator 0             */
    (int)&Comp1_IRQHandler,       /* Analog Comparator 1             */
    (int)&Comp2_IRQHandler,       /* Analog Comparator 2             */
    (int)&SysCtrl_IRQHandler,     /* System Control (PLL, OSC, BO)   */
    (int)&FlashCtrl_IRQHandler,   /* FLASH Control                   */
    (int)&GPIOPortF_IRQHandler,   /* GPIO Port F                     */
    (int)&GPIOPortG_IRQHandler,   /* GPIO Port G                     */
    (int)&GPIOPortH_IRQHandler,   /* GPIO Port H                     */
    (int)&UART2_IRQHandler,       /* UART2 Rx and Tx                 */
    (int)&SSI1_IRQHandler,        /* SSI1 Rx and Tx                  */
    (int)&Timer3A_IRQHandler,     /* Timer 3 subtimer A              */
    (int)&Timer3B_IRQHandler,     /* Timer 3 subtimer B              */
    (int)&I2C1_IRQHandler,        /* I2C1 Master and Slave           */
    //(int)&QEI1_IRQHandler,        /* Quadrature Encoder 1            */
    (int)&CAN0_IRQHandler,        /* CAN0                            */
    (int)&CAN1_IRQHandler,        /* CAN1                            */
    //(int)&CAN2_IRQHandler,        /* CAN2                            */
    //0,                            /* Reserved                        */
    (int)&EMAC0_IRQHandler, // [MG] TO ADD...
    (int)&Hibernate_IRQHandler,   /* Hibernate                       */
    (int)&USB0_IRQHandler,        /* USB0                            */
    (int)&PWMGen3_IRQHandler,     /* PWM Generator 3                 */
    (int)&uDMAST_IRQHandler,      /* uDMA Software Transfer          */
    (int)&uDMAError_IRQHandler,   /* uDMA Error                      */
    (int)&ADC1Seq0_IRQHandler,    /* ADC1 Sequence 0                 */
    (int)&ADC1Seq1_IRQHandler,    /* ADC1 Sequence 1                 */
    (int)&ADC1Seq2_IRQHandler,    /* ADC1 Sequence 2                 */
    (int)&ADC1Seq3_IRQHandler,    /* ADC1 Sequence 3                 */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    (int)&EPI0_IRQHandler, // [MG] TO ADD...
    (int)&GPIOPortJ_IRQHandler,   /* GPIO Port J                     */
    (int)&GPIOPortK_IRQHandler,   /* GPIO Port K                     */
    (int)&GPIOPortL_IRQHandler,   /* GPIO Port L                     */
    (int)&SSI2_IRQHandler,        /* SSI2 Rx and Tx                  */
    (int)&SSI3_IRQHandler,        /* SSI3 Rx and Tx                  */
    (int)&UART3_IRQHandler,       /* UART3 Rx and Tx                 */
    (int)&UART4_IRQHandler,       /* UART4 Rx and Tx                 */
    (int)&UART5_IRQHandler,       /* UART5 Rx and Tx                 */
    (int)&UART6_IRQHandler,       /* UART6 Rx and Tx                 */
    (int)&UART7_IRQHandler,       /* UART7 Rx and Tx                 */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    (int)&I2C2_IRQHandler,        /* I2C2 Master and Slave           */
    (int)&I2C3_IRQHandler,        /* I2C3 Master and Slave           */
    (int)&Timer4A_IRQHandler,     /* Timer 4 subtimer A              */
    (int)&Timer4B_IRQHandler,     /* Timer 4 subtimer B              */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    //0,                            /* Reserved                        */
    (int)&Timer5A_IRQHandler,     /* Timer 5 subtimer A              */
    (int)&Timer5B_IRQHandler,     /* Timer 5 subtimer B              */
    //(int)&WideTimer0A_IRQHandler, /* Wide Timer 0 subtimer A         */
    //(int)&WideTimer0B_IRQHandler, /* Wide Timer 0 subtimer B         */
    //(int)&WideTimer1A_IRQHandler, /* Wide Timer 1 subtimer A         */
    //(int)&WideTimer1B_IRQHandler, /* Wide Timer 1 subtimer B         */
    //(int)&WideTimer2A_IRQHandler, /* Wide Timer 2 subtimer A         */
    //(int)&WideTimer2B_IRQHandler, /* Wide Timer 2 subtimer B         */
    //(int)&WideTimer3A_IRQHandler, /* Wide Timer 3 subtimer A         */
    //(int)&WideTimer3B_IRQHandler, /* Wide Timer 3 subtimer B         */
    //(int)&WideTimer4A_IRQHandler, /* Wide Timer 4 subtimer A         */
    //(int)&WideTimer4B_IRQHandler, /* Wide Timer 4 subtimer B         */
    //(int)&WideTimer5A_IRQHandler, /* Wide Timer 5 subtimer A         */
    //(int)&WideTimer5B_IRQHandler, /* Wide Timer 5 subtimer B         */
    (int)&FPU_IRQHandler,         /* FPU                             */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    (int)&I2C4_IRQHandler,        /* I2C4 Master and Slave           */
    (int)&I2C5_IRQHandler,        /* I2C5 Master and Slave           */
    (int)&GPIOPortM_IRQHandler,   /* GPIO Port M                     */
    (int)&GPIOPortN_IRQHandler,   /* GPIO Port N                     */
    //(int)&QEI2_IRQHandler,        /* Quadrature Encoder 2            */
    //0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    (int)&Tamper_IRQHandler, // [MG] TO ADD...
    (int)&GPIOPortP0_IRQHandler,  /* GPIO Port P (Summary or P0)     */
    (int)&GPIOPortP1_IRQHandler,  /* GPIO Port P1                    */
    (int)&GPIOPortP2_IRQHandler,  /* GPIO Port P2                    */
    (int)&GPIOPortP3_IRQHandler,  /* GPIO Port P3                    */
    (int)&GPIOPortP4_IRQHandler,  /* GPIO Port P4                    */
    (int)&GPIOPortP5_IRQHandler,  /* GPIO Port P5                    */
    (int)&GPIOPortP6_IRQHandler,  /* GPIO Port P6                    */
    (int)&GPIOPortP7_IRQHandler,  /* GPIO Port P7                    */
    (int)&GPIOPortQ0_IRQHandler,  /* GPIO Port Q (Summary or Q0)     */
    (int)&GPIOPortQ1_IRQHandler,  /* GPIO Port Q1                    */
    (int)&GPIOPortQ2_IRQHandler,  /* GPIO Port Q2                    */
    (int)&GPIOPortQ3_IRQHandler,  /* GPIO Port Q3                    */
    (int)&GPIOPortQ4_IRQHandler,  /* GPIO Port Q4                    */
    (int)&GPIOPortQ5_IRQHandler,  /* GPIO Port Q5                    */
    (int)&GPIOPortQ6_IRQHandler,  /* GPIO Port Q6                    */
    (int)&GPIOPortQ7_IRQHandler,  /* GPIO Port Q7                    */
    //(int)&GPIOPortR_IRQHandler,   /* GPIO Port R                     */
    //(int)&GPIOPortS_IRQHandler,   /* GPIO Port S                     */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    (int)&SHA_IRQHandler,
    (int)&AES_IRQHandler,
    (int)&DES_IRQHandler,
    0,                            /* Reserved                        */
    //(int)&PWM1Gen0_IRQHandler,    /* PWM 1 Generator 0               */
    //(int)&PWM1Gen1_IRQHandler,    /* PWM 1 Generator 1               */
    //(int)&PWM1Gen2_IRQHandler,    /* PWM 1 Generator 2               */
    //(int)&PWM1Gen3_IRQHandler,    /* PWM 1 Generator 3               */
    //(int)&PWM1Fault_IRQHandler,   /* PWM 1 Fault                     */
    (int)&Timer6A_IRQHandler,     /* Timer 5 subtimer A              */
    (int)&Timer6B_IRQHandler,     /* Timer 5 subtimer B              */
    (int)&Timer7A_IRQHandler,     /* Timer 5 subtimer A              */
    (int)&Timer7B_IRQHandler,     /* Timer 5 subtimer B              */
    (int)&I2C6_IRQHandler,        /* I2C6 Master and Slave           */
    (int)&I2C7_IRQHandler,        /* I2C7 Master and Slave           */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    (int)&I2C8_IRQHandler,        /* I2C8 Master and Slave           */
    (int)&I2C9_IRQHandler,        /* I2C9 Master and Slave           */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
    0,                            /* Reserved                        */
};
#else
static constexpr std::array ISRVector {
    static_cast<ISRHander>(&__stack_end__),          // Top of Stack
    Reset_Handler,          // Reset Handler
    NMI_Handler,            // NMI Handler
    HardFault_Handler,      // Hard Fault Handler
    MemManage_Handler,      // The MPU fault handler
    BusFault_Handler,       // The bus fault handler
    UsageFault_Handler,     // The usage fault handler
};

#endif

// reset handler.
void Reset_Handler() {
    extern int main();
    extern int __libc_init_array();
    extern int __libc_fini_array();
    extern unsigned __data_start;  // start of .data in the linker script.
    extern unsigned __data_end__;  // end of .data in the linker script.
    extern unsigned const __data_load; // initialization values for .data.
    extern unsigned __bss_start__; // start of .bss in the linker script.
    extern unsigned __bss_end__;   // end of .bss in the linker script.
    extern void software_init_hook() __attribute__((weak));

    // CMSIS system initialization.
    SystemInit();

