smartinou/pfpp/firmware/apps/test_rtcc/startup_TM4C129ENCPDT.cpp
    // Copy the data segment initializers from flash to RAM...
    unsigned const *src{&__data_load};
    for (unsigned dst{&__data_start}; dst < &__data_end__; ++dst, ++src) {
        *dst = *src;
    }

    // Zero fill the .bss segment in RAM...
    for (unsigned dst{&__bss_start__}; dst < &__bss_end__; ++dst) {
        *dst = 0;
    }

    // Init hook provided?
    if (&software_init_hook != (void (*)())(0)) {
        // Give control to the RTOS.
        // this will also call __libc_init_array.
        software_init_hook();
    } else {
        // Call all static constructors in C++ (comment out in C programs).
        __libc_init_array();
        // Application's entry point; should never return!
        [[maybe_unused]] auto lResult = main();
        __libc_fini_array();
    }

    // The previous code should not return, but assert just in case...
    assert_failed("Reset_Handler", __LINE__);
}


// fault exception handlers
__attribute__((naked)) void NMI_Handler();
void NMI_Handler() {
    __asm volatile (
        "    ldr r0,=str_nmi\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_nmi: .asciz \"NMI\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void MemManage_Handler();
void MemManage_Handler() {
    __asm volatile (
        "    ldr r0,=str_mem\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_mem: .asciz \"MemManage\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void HardFault_Handler();
void HardFault_Handler() {
    __asm volatile (
        "    ldr r0,=str_hrd\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_hrd: .asciz \"HardFault\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void BusFault_Handler();
void BusFault_Handler() {
    __asm volatile (
        "    ldr r0,=str_bus\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_bus: .asciz \"BusFault\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void UsageFault_Handler();
void UsageFault_Handler() {
    __asm volatile (
        "    ldr r0,=str_usage\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_usage: .asciz \"UsageFault\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void Default_Handler();
void Default_Handler() {
    __asm volatile (
        "    ldr r0,=str_dflt\n\t"
        "    mov r1,#1\n\t"
        "    b assert_failed\n\t"
        "str_dflt: .asciz \"Default\"\n\t"
        "  .align 2\n\t"
    );
}


//****************************************************************************
// The function assert_failed defines the error/assertion handling policy
// for the application. After making sure that the stack is OK, this function
// calls Q_onAssert, which should NOT return (typically reset the CPU).
//
// NOTE: the function Q_onAssert should NOT return.
//****************************************************************************
__attribute__ ((naked))
void assert_failed(char const *module, int loc) {
    /* re-set the SP in case of stack overflow */
    __asm volatile (
        "  MOV sp,%0\n\t"
        : : "r" (&__stack_end__));

    //Q_onAssert(module, loc); /* call the application-specific QP handler */

    while (1) {
        // Should not be reached, but just in case loop forever...
    }
}

// End Of File
